// MahsolShowcase.jsx
import React from "react";
import ProductCard from "./ProductCard";

const products = [
    {
    id: 201,
    title: "نانو عایق آبی استخری",
      prices: [
    { option: "کیلو", price: "2,200,000" },
    { option: "گالن", price: "8,000,000" },
    { option: "دبه", price: "19,500,000" },
    { option: "حلب", price: "36,500,000" },
    { option: "کارتن ۲۴ عددی", price: "26,400,000" }, 
  ],

    image: "/img//IMG_6244.JPG",
    description: "عایق نانو الاستومری آبی استخری | جایگزین ١٠٠ درصد قیر و ایزوگام | دارای رنگ بندی دلخواه مشتری | مناسب برای انواع نمای داخلی و خارجی | مناسب انواع سطوح آهنی، سیمانی، سنگی، چوبی و... | آببندی انواع مخازن، آب‌انبار، استخر، آبنما | سازگاری با محیط زیست | آنتی باکتریال | آنتی UV | مقاومت دمایی بالا از منفی ٣٠ درجه تا مثبت ١٢٠ درجه",
    rating: 3,
    images: [
    "/img//IMG_6244.JPG"
    ],
  },  
  
  {
  id: 202,
  title: "خمیر درزگیر و بندکشی",
  prices: [
    { option: "کارتن ۲۴ عددی سفید", price: "21,000,000" },
    { option: "کارتن ۲۴ عددی کریستالی", price: "22,000,000" },
    { option: "کارتن ۲۴ عددی رنگی", price: "22,000,000" }
  ],
  image: "/img/012 (1).jpg",
  description: "نانو خمیر درزگیری و بندکشی استنددار | ١٠٠ درصد آببند | تیوپی در رنگبندی‌های مختلف و کریستالی بی‌رنگ | دارای درب نازل و لیسه | مناسب برای تمامی سطوح | یک بار برای همیشه | آنتی باکتریال | آنتی UV | سازگاری با محیط زیست"
,
  rating: 4,
  images: [
    "/img/خمیردرزگیر و بندکشی2.jpg"
  ]
},

  {
    id: 203,
    title: "نانو عایق سفید و رنگی الاستومری",
      prices: [
    { option: "کیلو", price: "2,200,000" },
    { option: "گالن", price: "8,000,000" },
    { option: "دبه", price: "19,500,000" },
    { option: "حلب", price: "36,500,000" },
    { option: "کارتن ۱۲ عددی", price: "26,400,000" }
  ],
    image: "/img/01.jpg",
      description: "عایق‌های الاستومری رطوبتی، برودتی و حرارتی، جایگزین ۱۰۰٪ قیر و ایزوگام. دارای رنگ‌بندی دلخواه مشتری و مناسب برای انواع نمای داخلی و خارجی. قابل استفاده بر روی سطوح آهنی، سیمانی، سنگی، چوبی و ... . ایده‌آل برای آب‌بندی مخازن، لوله‌ها، سقف‌های شیروانی، پشت‌بام‌ها، دیوارهای باران‌گیر، نماها، استخر و سایر سطوح حساس به رطوبت. دارای خاصیت ضدآب و آب‌گریزی، مناسب جهت پوشش‌دهی سطوح آجرنما، چوبی، سیمانی و سنگی برای جلوگیری و رفع نم. آنتی‌باکتریال، ضد اشعه UV و سازگار با محیط زیست. همچنین قابلیت ترکیب با انواع پودرهای نانو و سیمانی برای تقویت آب‌بندی را دارا می‌باشد."
,
    rating: 4,
    images: [
      "/img/عایق نانو الاستومری.jpg",
      "/img/01.jpg",
     
    ],
  },

  {
    id: 204,
    title: "بتونه همه کاره ضد ترک آببند",
      prices: [
    { option: "گالن", price: "7,000,000" },
    { option: "دبه ", price: "14,500,000" },
  ],
    image: "/img/02.jpg",
      description: "عایق‌های الاستومری رطوبتی، برودتی و حرارتی، جایگزین ۱۰۰٪ قیر و ایزوگام. دارای رنگ‌بندی دلخواه مشتری و مناسب برای انواع نمای داخلی و خارجی. قابل استفاده بر روی سطوح آهنی، سیمانی، سنگی، چوبی و ... . ایده‌آل برای آب‌بندی مخازن، لوله‌ها، سقف‌های شیروانی، پشت‌بام‌ها، دیوارهای باران‌گیر، نماها، استخر و سایر سطوح حساس به رطوبت. دارای خاصیت ضدآب و آب‌گریزی، مناسب جهت پوشش‌دهی سطوح آجرنما، چوبی، سیمانی و سنگی برای جلوگیری و رفع نم. آنتی‌باکتریال، ضد اشعه UV و سازگار با محیط زیست. همچنین قابلیت ترکیب با انواع پودرهای نانو و سیمانی برای تقویت آب‌بندی را دارا می‌باشد."
,
    rating: 4,
    images: [
      "/img/batonhame.jpg",
      "/img/02.jpg",
     
    ],
  },


    {
  id: 205,
  title: "نانو عایق تی ۲۰",
  prices: [
    { option: "کیلو", price: "2,200,000" },
    { option: "گالن", price: "8,000,000" },
    { option: "دبه", price: "19,500,000" },
    { option: "حلب", price: "36,500,000" }

  ],
  image: "/img/IMG_6247.JPG",
  description: "عایق نانو آببندی کریستالی T20 | جایگزین ١٠٠ درصد قیر و ایزوگام | اجرای سریع و آسان بدون نیاز به تخریب | وزن سبک برای استحکام ساختمان | مخصوص بندکشی سطوح کاشی، سرامیک و سنگ | مناسب اجرا بر روی انواع توری جهت آببندی | قابلیت ترکیب با انواع پودر و سیمان جهت آببندی (به ازای هر ٥٠ کیلو پودر، ٢ کیلو عایق) | آببندی انواع مخازن، لوله، سقف‌های شیروانی، پشت‌بام، دیوار باران‌گیر، انواع نما، استخر و... | سازگاری با محیط زیست | آنتی باکتریال | آنتی UV | مقاومت دمایی از منفی ٣٠ درجه تا مثبت ١٢٠ درجه",
  rating: 4,
  images: [
    "/img/04.jpg",
  ]
},
  
  
  




];

function MahsolShowcase() {
  return (
    <div className="product-list">
      {products.map((item) => (
        <ProductCard
          key={item.id}
          id={item.id}
          title={item.title}
          prices={item.prices}
          image={item.image}
          description={item.description}
          images={item.images}
          rating={item.rating}
        />
      ))}
    </div>
  );
}

export default MahsolShowcase;
