// MahsolShowcase.jsx
import React from "react";
import ProductCard from "./ProductCard";

const products = [
  {
    id: 401,
       title: "پوش رنگ اکرلیک  بنفش",
               prices: [
    { option: "گالن", price: 6600000 },
    { option: "دبه", price: 16200000 },
  ] ,
    image: "/img/IMG_5826.JPG",
    description: "رنگ‌های آکریلیک و پرایمر - از بهترین رزین‌های آکریلیک پایه آب تهیه شده، دارای چسبندگی و قدرت پوشش خوب می‌باشد. حاوی ترکیبات آلی فرار کم، با بوی ناچیز و دوست‌دار محیط زیست است. مناسب برای انواع سطوح گچی، آجری و سیمانی. قابلیت پاک کردن کثیفی از سطح رنگ را دارا می‌باشد."
,
    rating: 4,
    images: [
       "/img/07.jpg",
      "/img/IMG_5826.JPG",
       
     
    ],
  },


    {
    id: 402,
    title: "پوشرنگ اکرلیک ۸۰۲ مات",
      prices: [
    { option: "دبه", price: "9,000,000" },
    { option: "گالن", price: "4,300,000" },
  ],
    image: "/img/IMG_5820.JPG",
    description: "عایق‌های الاستومری رطوبتی، برودتی و حرارتی، جایگزین ۱۰۰٪ قیر و ایزوگام. دارای رنگ‌بندی دلخواه مشتری و مناسب برای انواع نمای داخلی و خارجی. قابل استفاده بر روی سطوح آهنی، سیمانی، سنگی، چوبی و ... . ایده‌آل برای آب‌بندی مخازن، لوله‌ها، سقف‌های شیروانی، پشت‌بام‌ها، دیوارهای باران‌گیر، نماها، استخر و سایر سطوح حساس به رطوبت. دارای خاصیت ضدآب و آب‌گریزی، مناسب جهت پوشش‌دهی سطوح آجرنما، چوبی، سیمانی و سنگی برای جلوگیری و رفع نم. آنتی‌باکتریال، ضد اشعه UV و سازگار با محیط زیست. همچنین قابلیت ترکیب با انواع پودرهای نانو و سیمانی برای تقویت آب‌بندی را دارا می‌باشد."
,
    rating: 3,
    images: [
      "/img/09.jpg",
      "/img/IMG_5820.JPG"
      
      
    ],
  },

  {
    id: 403,
    title: "پوش رنگ اکرلیک آبی مات",
              prices: [
    { option: "گالن", price: "9,000,000" },
    { option: "دبه", price: "4,300,000" },
  ] ,
    image: "/img/IMG_5821.JPG",
    description: "رنگ‌های آکریلیک و پرایمر - از بهترین رزین‌های آکریلیک پایه آب تهیه شده، دارای چسبندگی و قدرت پوشش خوب می‌باشد. حاوی ترکیبات آلی فرار کم، با بوی ناچیز و دوست‌دار محیط زیست است. مناسب برای انواع سطوح گچی، آجری و سیمانی. قابلیت پاک کردن کثیفی از سطح رنگ را دارا می‌باشد."
,
    rating: 5,
    images: [
      "/img/IMG_5821.JPG",
      "/img/08.jpg",
      "/img/010.jpg",
    ],
  },
  {
    id: 404,
       title: "پوشرنگ نیم پلاستیک",
             prices: [
    { option: "گالن", price: "2,750,000" },
    { option: "دبه", price: "6,050,000" },
  
  ] ,
    image: "/img/IMG_6245.JPG",
    description: "رنگ‌های آکریلیک و پرایمر - از بهترین رزین‌های آکریلیک پایه آب تهیه شده، دارای چسبندگی و قدرت پوشش خوب می‌باشد. حاوی ترکیبات آلی فرار کم، با بوی ناچیز و دوست‌دار محیط زیست است. مناسب برای انواع سطوح گچی، آجری و سیمانی. قابلیت پاک کردن کثیفی از سطح رنگ را دارا می‌باشد."
,
    rating: 3,
    images: [
      "/img/01.JPG",

      
    ],
  },


    {
    id: 405,
       title: "پوشرنگ نیم پلاسیتک STFAM",
             prices: [
    { option: "گالن", price: "1,800,000" },
    { option: "دبه", price: "3,800,000" },
    { option: "حلب", price: "7,350,000" },
  
  ] ,
    image: "/img/IMG_5822.JPG",
    description: "رنگ‌های آکریلیک و پرایمر - از بهترین رزین‌های آکریلیک پایه آب تهیه شده، دارای چسبندگی و قدرت پوشش خوب می‌باشد. حاوی ترکیبات آلی فرار کم، با بوی ناچیز و دوست‌دار محیط زیست است. مناسب برای انواع سطوح گچی، آجری و سیمانی. قابلیت پاک کردن کثیفی از سطح رنگ را دارا می‌باشد."
,
    rating: 3,
    images: [
      "/img/IMG_5822.JPG",

      
    ],
  },


    {
    id: 406,
    title: "اکرلیک پرایمن درجه یک ممتاز",

             prices: [
    { option: "دبه", price: "7,800,000" },
  ] ,
  
    image: "/img/IMG_5824.JPG",
    description:"رنگ های اکریلیک و پرایمینن از بهترین رزین های اکریلیک آب پایه تهیه شده دارای چسبندگی و قدرت پوشش خوبی میباشد حاوی ترکیبات آلی فرار و بوی کم و دوستدار محیط زیست میباشد مناسب برای انواع سطوح گچی و آجری و سیمانی میباشد",
    rating: 3,
    images: [
      "/img/IMG_5824.JPG",
      "/img/03.jpg",
      
    ],
  },
    {
    id: 407,
    title: "مادر رنگ دو کاره ",
      prices: [
    { option: "ربعی کارتن ۲۴ عددی", price: "12,000,000" },
    { option: "کیلو کارتن ۱۲ عددی", price: "12,000,000" },
  ],
    image: "/img//IMG_6098.JPG",
    description: "محصولی مناسب برای محافظت از سطوح ساختمانی.",
    rating: 3,
    images: [
    "/img//IMG_6098.JPG"
    ],
  },

    {
    id: 408,
    title: "دکوراتیو صدف طلایی",
          prices: [
    { option: "ربعی کارتن ۲۴ عددی", price: "30,240,000" },
    { option: "کیلو کارتن ۱۲ عددی", price: "33,600,000" },
  ],
    image: "/img/IMG_5828.JPG",
    description: "مادر رنگ دوکاره مخصوص رنگ‌های اکریلیک و پلاستیک، دارای طیف رنگی متنوع با پوشش‌دهی بالا و مقاومت بالا می‌باشد. آنتی‌باکتریال و سازگار با محیط زیست است. قابلیت ترکیب شدن با رنگ‌های پلاستیک و اکریلیک را دارد."
,
    rating: 5,
    images: [
      "/img/IMG_5828.JPG",
      "/img/013.jpg",
      "/img/014.jpg"
      
    ],
  },

    {


    id: 409,
    title: "دکوراتیو سورمه ای ",

              prices: [
    { option: "ربعی کارتن ۲۴ عددی", price: "30,240,000" },
    { option: "کیلو کارتن ۱۲ عددی", price: "33,600,000" },
  ],
    image: "/img/IMG_5827.JPG",
    description: "مادر رنگ دوکاره مخصوص رنگ‌های اکریلیک و پلاستیک، دارای طیف رنگی متنوع با پوشش‌دهی بالا و مقاومت بالا می‌باشد. آنتی‌باکتریال و سازگار با محیط زیست است. قابلیت ترکیب شدن با رنگ‌های پلاستیک و اکریلیک را دارد."
,
    rating: 4,
    images: [
      "/img/IMG_5827.JPG",
      "/img/018.jpg",
      
    ],
  },




];

function MahsolShowcase() {
  return (
    <div className="product-list">
      {products.map((item) => (
        <ProductCard
          key={item.id}
          id={item.id}
          title={item.title}
          prices={item.prices}
          image={item.image}
          description={item.description}
          images={item.images}
          rating={item.rating}
        />
      ))}
    </div>
  );
}

export default MahsolShowcase;
